20260131135117-sentinel_controlled_while_loop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-07 Sat 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sentinel-Controlled While Loop</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Sentinel-Controlled While Loop</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdfca152">1. Sentinel-Controlled While Loop</a>
<ul>
<li><a href="#org53b8b89">1.1. <b>Key idea</b></a></li>
<li><a href="#org7acc7b5">1.2. <b>When to use</b></a>
<ul>
<li><a href="#orgc7c6e17">1.2.1. <b>Typical structure</b></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdfca152" class="outline-2">
<h2 id="orgdfca152"><span class="section-number-2">1.</span> Sentinel-Controlled While Loop</h2>
<div class="outline-text-2" id="text-1">
<p>
A <b>sentinel-controlled while loop</b> repeatedly reads input and processes it until a special value (<code>sentinel</code>) is encountered.
</p>

<p>
It signals <b>termination</b>.
</p>
</div>

<div id="outline-container-org53b8b89" class="outline-3">
<h3 id="org53b8b89"><span class="section-number-3">1.1.</span> <b>Key idea</b></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>The <code>loop</code> continues <b>while</b> the input is not equal to the <code>sentinel</code>.</li>
<li>When the <code>sentinel</code> is read, the loop <b>stops</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org7acc7b5" class="outline-3">
<h3 id="org7acc7b5"><span class="section-number-3">1.2.</span> <b>When to use</b></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>You don’t know in advance how many data items will be processed.</li>
<li>You read input until a special termination value (<b>sentinel</b>) is reached.</li>
</ul>
</div>

<div id="outline-container-orgc7c6e17" class="outline-4">
<h4 id="orgc7c6e17"><span class="section-number-4">1.2.1.</span> <b>Typical structure</b></h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">Scanner</span> <span class="org-variable-name">in</span> = <span class="org-keyword">new</span> <span class="org-type">Scanner</span>(System.in);
<span class="org-type">int</span> <span class="org-variable-name">value</span> = in.nextInt();        <span class="org-comment-delimiter">// </span><span class="org-comment">read initial input
</span><span class="org-keyword">while</span> (value != SENTINEL) {      <span class="org-comment-delimiter">// </span><span class="org-comment">check sentinel
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">process value
</span>    value = in.nextInt();        <span class="org-comment-delimiter">// </span><span class="org-comment">read next
</span>}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org31ab642"></a><b>Example: Sum positive integers until '–1' is entered</b><br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
In this example, the sentinel value is <code>–1</code>.
</p>

<p>
Valid input values are <b>non</b>-<b>negative</b> <code>integers</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">Scanner</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">SentinelExample</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">Scanner</span> <span class="org-variable-name">scanner</span> = <span class="org-keyword">new</span> <span class="org-type">Scanner</span>(System.in);

        <span class="org-type">int</span> <span class="org-variable-name">sum</span> = 0;
        System.out.print(<span class="org-string">"Enter a positive integer (or -1 to quit): "</span>);
        <span class="org-type">int</span> <span class="org-variable-name">number</span> = scanner.nextInt(); <span class="org-comment-delimiter">// </span><span class="org-comment">read first value
</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">loop until sentinel (-1) is entered
</span>        <span class="org-keyword">while</span> (number != -1) {
            sum += number;  <span class="org-comment-delimiter">// </span><span class="org-comment">add to sum
</span>
            System.out.print(<span class="org-string">"Enter a positive integer (or -1 to quit): "</span>);
            number = scanner.nextInt(); <span class="org-comment-delimiter">// </span><span class="org-comment">read next value
</span>        }

        System.out.println(<span class="org-string">"Total sum: "</span> + sum);
        scanner.close();
    }
}
</pre>
</div>

<p>
<b>How it works</b>
</p>
<ul class="org-ul">
<li>The first value is <b>read</b> before the loop.</li>
<li>The <code>loop</code> condition checks if it’s not the <b>sentinel</b>.</li>
<li>Inside the loop we process the value (add to sum).</li>
<li>Then we read the next value to update the loop condition.</li>
</ul>

<p>
<b>Benefits</b>
</p>
<ul class="org-ul">
<li>Simple pattern for unknown number of inputs.</li>
<li>Easy to understand and maintain.</li>
</ul>

<p>
<b>Caveats</b>
</p>
<ul class="org-ul">
<li>Must read initial value before the loop.</li>
<li>Must update value within the loop, otherwise infinite loop.</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
